/* ========================================================================== */
/* Import                                                                     */
/* ========================================================================== */
import { createReducer } from '@reduxjs/toolkit';
import * as C from './constants';
import * as A from './actions';

/* ========================================================================== */
/* Actions                                                                    */
/* ========================================================================== */

/* ========================================================================== */
/* Reducer                                                                    */
/* ========================================================================== */
const initial_state = {
    turn_count: 0,
    next_player: 0,
    board: [
        [-2, -3, -4, -5, -8, -5, -4, -3, -2],
        [ 0, -7,  0,  0,  0,  0,  0, -6,  0],
        [-1, -1, -1, -1, -1, -1, -1, -1, -1],
        [ 0,  0,  0,  0,  0,  0,  0,  0,  0],
        [ 0,  0,  0,  0,  0,  0,  0,  0,  0],
        [ 0,  0,  0,  0,  0,  0,  0,  0,  0],
        [ 1,  1,  1,  1,  1,  1,  1,  1,  1],
        [ 0,  6,  0,  0,  0,  0,  0,  7,  0],
        [ 2,  3,  4,  5,  8,  5,  4,  3,  2]
    ],
    mochigoma: [
        [0, 1, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 1, 0, 0, 0, 0]
    ],
    grabbed_koma: {
        source: C.SRC_BOARD,
        index: {
            dan: 6,             /* 盤面上の選択に使用 */
            suji: 2,            /* 盤面上の選択に使用 */
            koma: C.KOMA_NONE   /* 持ち駒の選択に使用 */
        }
    },
    legal_moves: [
        [0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 1, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0, 0]
    ],
    view: C.PLAYER_SENTE,
    kifu: []
}

const reducer = createReducer(initial_state, (builder) => {
    builder
        .addCase(A.actGrabKoma, (state, action) => {
            console.dir(action);
            state.grabbed_koma = {
                source: action.payload.source,
                index: action.payload.index
            }
        })
})


export default reducer;